app/views/contents/_form.html.erb

SELECT "visits".* FROM "visits"
---
          <span id='drop'>Select Related Visit</span><br/>
             <a class="medium button dropdown" style="background:none; border:none; margin-left:-20px"><%= f.collection_select(:visit_id, Visit.all, :id, :location)%> </a>