app/views/contents/_new.html.erb

                     <span id='drop'>Select Related Visit</span><br/>
                     <a><%= f.collection_select(:visit_id, Visit.all, :id, :location)%> </a>
---
SELECT "visits".* FROM "visits"