app/views/events/_form.html.erb

SELECT "eventdays".* FROM "eventdays"
---
   <span class='eventlab'>Event Date</span><br/>
   <a class="medium button dropdown" style="background:none; border:none; margin-left:-20px"><%= f.collection_select(:eventday_id, Eventday.all, :id, :day)%> </a>