app/controllers/articles_controller.rb

  def index
    @articles = Article.all
    @articles = Article.order(:title).page(params[:page])
---
SELECT "articles".* FROM "articles" ORDER BY title LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"