app/controllers/contents_controller.rb

  def index
    @content = Content.new
    @search = Content.joins(:visit).search(params[:q])
    @contents = @search.result
    @contents = @contents.joins(:visit)
    @search.build_condition if @search.conditions.empty?
---
SELECT "contents".* FROM "contents" INNER JOIN "visits" ON "visits"."id" = "contents"."visit_id"
SELECT "visits".* FROM "visits"

  def show
    @content = Content.find(params[:id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT 1  [["id", "980190962"]]

  def destroy
    @content = Content.find(params[:id])
    @content.destroy
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT 1  [["id", "980190962"]]
DELETE FROM "contents" WHERE "contents"."id" = $1  [["id", 980190962]]