app/controllers/eventdays_controller.rb

  def index
    @eventdays = Eventday.all
---
SELECT "eventdays".* FROM "eventdays"

  def show
    @eventday = Eventday.find(params[:id])
---
SELECT "eventdays".* FROM "eventdays" WHERE "eventdays"."id" = $1 LIMIT 1  [["id", "980190962"]]

  def create
    @eventday = Eventday.new(params[:eventday])

    respond_to do |format|
      if @eventday.save
---
INSERT INTO "eventdays" ("created_at", "date", "day", "month", "updated_at", "year") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Wed, 04 Dec 2013 07:27:02 UTC +00:00], ["date", nil], ["day", "MyString"], ["month", nil], ["updated_at", Wed, 04 Dec 2013 07:27:02 UTC +00:00], ["year", nil]]

  def destroy
    @eventday = Eventday.find(params[:id])
    @eventday.destroy
---
SELECT "eventdays".* FROM "eventdays" WHERE "eventdays"."id" = $1 LIMIT 1  [["id", "980190962"]]
DELETE FROM "eventdays" WHERE "eventdays"."id" = $1  [["id", 980190962]]